In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
%matplotlib inline
import matplotlib 
matplotlib.rcParams["figure.figsize"] = (20,10)

In [2]:
df = pd.read_csv("Bengaluru_House_Data.csv")
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df.shape

(13320, 9)

In [5]:
df["area_type"].value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [6]:
df2 = df.drop(['area_type','society','balcony','availability'],axis='columns')
df2.shape

(13320, 5)

In [7]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [8]:
df2.dropna(inplace=True)
df2.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [9]:
df2.sample(25)

                  location       size total_sqft  bath   price
2504        Kanakpura Road      2 BHK       1077   2.0   37.70
5837      Hebbal Kempapura      2 BHK       1130   2.0   60.00
893       Ramamurthy Nagar      2 BHK       1050   2.0   37.00
9031   Tala Cauvery Layout      3 BHK       1720   2.0  126.00
5817            Anandapura      2 BHK       1151   2.0   42.90
590             Kanakapura      3 BHK       1419   3.0   75.00
1756            Whitefield  4 Bedroom       4000   4.0  330.00
6807           Uttarahalli      2 BHK       1125   2.0   48.00
5969               Sompura      2 BHK       1126   2.0   39.00
1382         Richmond Town      3 BHK       2200   3.0  187.00
8621                Anekal      3 BHK       1150   3.0   45.00
1925          Kanaka Nagar      3 BHK    2479.13   3.0  215.00
12075   4th Phase JP Nagar      2 BHK        600   4.0   70.00
1326          Bommanahalli      2 BHK       1200   2.0   40.00
10101  9th Block Jayanagar  6 Bedroom       1200   5.0  280.00
6302           Thanisandra      2 BHK        934   2.0   55.00
12964         Haralur Road      3 BHK       1810   3.0   97.83
3430             Bellandur      4 BHK       3016   4.0  230.00
5919     Nagawara Junction  2 Bedroom        600   2.0   30.00
2488           Thanisandra      2 BHK       1185   2.0   43.00
10292       Thigalarapalya      4 BHK       4190   4.0  325.00
7573                 Hoodi  4 Bedroom       1100   4.0  120.00
7415            Anandapura  2 Bedroom       1200   2.0   58.00
1574           Singasandra  4 Bedroom       3850   6.0  195.00
2206            Begur Road      3 BHK       1410   2.0   53.00

In [10]:
df2["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [14]:
df2["BHK"] = df2["size"].apply(lambda x:int(x.split(" ")[0]))

In [15]:
df2["BHK"].head()

0    2
1    4
2    3
3    3
4    2
Name: BHK, dtype: int64

In [20]:
df2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [24]:
def total_sqft_fix (x):
    splits = x.split("-")
    if len(splits)==2:
        return (float(splits[0])+float(splits[1]))/2
    try:
        return float(x)
    except:
        return None

In [25]:
total_sqft_fix("2152-5555")

3853.5

In [28]:
df2["total_sqft"]=df2["total_sqft"].apply(total_sqft_fix)

In [29]:
df2["total_sqft"].head()

0    1056.0
1    2600.0
2    1440.0
3    1521.0
4    1200.0
Name: total_sqft, dtype: float64

In [32]:
df2["total_sqft"].isnull().sum ()

46

In [33]:
df2.dropna(inplace=True)

In [34]:
df2.isnull().sum ()

location      0
size          0
total_sqft    0
bath          0
price         0
BHK           0
dtype: int64

In [35]:
df2['price_per_sqft'] = df2['price']*100000/df2['total_sqft']
df2.head()

,location,size,total_sqft,bath,price,BHK,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [36]:
df2.location = df2.location.apply(lambda x: x.strip())

In [37]:
df2.location.head()

0    Electronic City Phase II
1            Chikka Tirupathi
2                 Uttarahalli
3          Lingadheeranahalli
4                    Kothanur
Name: location, dtype: object

In [39]:
location_stats = df2['location'].value_counts(ascending=False)
location_stats

Whitefield                            533
Sarjapur  Road                        392
Electronic City                       304
Kanakpura Road                        264
Thanisandra                           235
                                     ...
Kengeri Satellite Town ( BDA SITE)      1
PC Palaya                               1
Beml layout, Rajarajeshwari nagar       1
Sir M V Nagar                           1
elachenahalli                           1
Name: location, Length: 1287, dtype: int64

In [40]:
location_stats.values.sum()

13200

In [41]:
len(location_stats[location_stats>10])

240

In [42]:
len(location_stats)

1287

In [43]:
len(location_stats[location_stats<=10])

1047

In [44]:
location_stats_less_than_10 = location_stats[location_stats<=10]
location_stats_less_than_10

Sector 1 HSR Layout                   10
Gunjur Palya                          10
Ganga Nagar                           10
Dairy Circle                          10
Basapura                              10
                                      ..
Kengeri Satellite Town ( BDA SITE)     1
PC Palaya                              1
Beml layout, Rajarajeshwari nagar      1
Sir M V Nagar                          1
elachenahalli                          1
Name: location, Length: 1047, dtype: int64

In [48]:
df2.location = df2.location.apply(lambda x :"other" if x in location_stats_less_than_10 else x)
df2[df2.location=="other"].count()[0]

2872

In [53]:
df2[df2.total_sqft/df2.BHK<300].count()[0]

744

In [54]:
df2 = df2[~(df2.total_sqft/df2.BHK<300)]
df2.shape

(12456, 7)

In [55]:
df2.price_per_sqft.describe()

count     12456.000000
mean       6308.502826
std        4168.127339
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [ ]:
def outliers_removal (df):
    for key,df_ in df.group("location"):
        m = np.mean(df_.price_per_sqft)
        std = np.std(df_.price_per_sqft)